class AnswerText:
    START = (
        "Меня зовут MarketCoinBot и с моей помощью ты сможешь "
        "подключиться к своему аккаунту на бирже Bybit, управлять позициями и ордерами "
        "на SPOT рынке, 📈 выводить информацию по счету и узнавать цены нужных монет! 💰📊"
    )
    HELP = (
        "Привет! 😊 Я MarketCoinBot и я сотрудничаю с биржей Bybit! С моей помощью у тебя есть возможность:\n"
        "1. Получить информацию по счету 💳\n"
        "2. Управлять позициями на спотовом рынке  📈\n"
        "3. Получить информацию по ценам монет 💰"
    )
    GET_COIN_INFO = (
        "Здесь вы можете получить текущую информацию по рынку. Для этого выберете "
        "соответсвующую кнопку меню."
    )
    CONNECTION_API_KEYS = "Здесь вы можете добавить имеющиеся API ключи или удалить их."
    START_TRADING_answer = (
        "В этом разделе вы сможете управлять позициями и смотреть информацию о счете"
        "(чтобы пользоваться этим разделом необходимо подключить API-keys)"
    )
    FILTER_TEXT = "Не понимаю что это 🤨!? Ключи должны быть в текстовом формате!"
    INPUT_API_PUB = "Введите публичный ключ (API Key):"
    INPUT_API_SECRET = "Теперь, введите секретный ключ (API secret):"
    RETURN_TO_MENU = "Возвращаюсь в главное меню"
    DELETE_KEYS = "Вы уверены что хотите удалить ключи из базы данных?"
    ADD_THE_KEY = "✏️ Сначало добавьте ключи!"
    KEY_IS_RECORDED = "Ключи успешно записаны!"
    KEY_IS_REMOVED = "Ключи удалены!"
    I_STILL_HAVE_THE_KEY = "Ключи все еще у меня!"
    UNKNOWN_COMMAND = "Не понял команду🤔, пожалуйста нажмите на кнопку снизу."
    WHAT_IS_IT = "Что это 🧐?"
    INCORRECT_INPUT = "Не понял!?🤔 Пожалуйста нажмите на одну из кнопок снизу!"
    INPUT_COINS_NAME = "Введите название интересующей монеты:"
    NO_API = "Сначало подключите API-keys в настройках профиля"
